import { Scene } from '../../../../types';

// 上午-1
export const day1ScenesPart3: Record<string, Scene> = {
  'F70-Parting': {
    id: 'F70-Parting',
    title: '分别',
    description: '分别',
    paragraphs: [
      { text: '“罗德里克。”大骑士说，“殿下就交给你了。”' },
      { text: '“职责所在，爵士。”罗德里克·索恩对他尊敬地颔首。随后，大骑士从你的身边离开。' },
      { text: '你的目光几乎立刻就追了上去，他把芬因·里德也带走了。“你们要去哪？”你忍不住就要追上去，罗德里克·索恩伸出手拦住了你。他回答道：“他们要去红袍塔。”' },
      { text: '“红袍塔？”' },
      { text: '“那是我们的居所和驻地，就在那。”凯安指了指，你看过去，发现确实有一幢建筑。“放心吧陛下，这离得近着呢。布莱克爵士看起来得和您那位——嗯，朋友？有些事情要交代。”' },
      { text: '“我还可以再见到他们吗？”' },
      { text: '面对你泛红的眼圈，凯安笑了。“这可说不好。”他说得很轻松，“我当初在那呆了三个月才被放出来。你那位金发小朋友，恐怕......”' },
      { text: '“凯安。”' },
      { text: '凯安耸了耸肩。罗德里克·索恩说：“您会再见到他们的。”' },
      { text: '“您能向我保证吗，索恩爵士？”你目不转睛地看着他，嘴唇被咬得发白。' },
      { text: '“我向您保证。”罗德里克认真地说，“您会再见到他们的。”' },
      { text: '“女王陛下。”' },
      { text: '站在一旁的中年男女终于走了过来。他们穿着和红袍卫士截然不同的衣服，但都戴着白手套。' },
      { text: '“我是您的女官长，[C:艾莉丝·威斯特]。他是您的宫廷总管，[C:西蒙·柴勒]。”' },
      { text: '“您一路奔波，现在最需要的是换身衣服，休息一下。”她不留痕迹地看过几位红袍卫士，最后对你微微欠身，“房间已经准备好了，请跟我来。”' },
      { text: '这时，你发现玛格丽特修女不见了。' }
    ],
    choices: [
      { text: '继续', nextSceneId: 'Act2ChapterSplash' }
    ]
  }
};
