import { Scene } from "../../../../types";

export const day2Scenes01: Record<string, Scene> = {
  "F118-GetUp": {
    id: "F118-GetUp",
    title: "起床",
    paragraphs: [
      { text: "你被侍女轻声唤醒时，凯斯的晨光已普照大地。意识从睡梦的朦胧中浮起，当新一天的轮廓变得清晰，你意识到自己在床上。" },
      { text: "......这里是——昨晚——......", isThought: true },
      { text: "“陛下。”\n几位侍女，一、二、三、四。在四双手中，你被褪去睡裙、梳理长发，热水散发着清洁的气息，你从水中看到自己的脸。" },
      { text: "凯瑟琳·赫西。", isThought: true },
      { text: "......你看起来真累啊。", isThought: true },
      { text: "她们的动作迅速而轻柔，熟悉的感觉唤起你昨日的记忆。\n漫长的一天里，你真正进入了凯斯城，继而是红堡。在这里，你见到了许多人；夜晚......" },
      { text: "“芬因呢？”" },
      { text: "你随口看向其中一个侍女，她正为你展开今日的衣袍。那是一件深蓝色的丝绸长裙，领口和袖口绣着银色的狐狸纹章，狐狸的尾巴蓬松而卷曲。\n不同于昨日的衣裙，它的长度刚好垂至你的脚背。你不需要提起它，它会像流水一样伴随。" },
      { text: "她为你换上这件礼服，腰间束起一条用银丝编织的腰带，其间挂有一枚七星圣纹。" },
      { text: "“和您一起来的那位已经回红袍塔了，如果您要传唤他，早餐结束之后他会奉命前来。”她不疾不徐地说。" },
      { text: "你的目光在那件裙子上停留了片刻。还不错，你想，凯斯的审美和翠谷那边还真有些不一样......你在翠谷的衣服舒适而实用，亚麻色和淡绿色是你最常穿的颜色；但凯斯的衣服更华丽，每一处刺绣都是无声的身份证明。" },
      { text: "叩叩。\n门被敲响了，接着，艾莉丝·韦斯特走了进来。发间有灰白之色的女官长向你行礼，“陛下，您的贴身女官已经在东侧厅等候。您要现在过去吗？”" },
      { text: "“贴身女官？”" },
      { text: "新的概念。", isThought: true },
      { text: "“她们都是些样貌姣好，举止端良的贵族小姐。作为您的贴身女官，她们会陪同您出席宴会，在您需要时，帮您记住陌生人的名字和面孔，或替您传话，也能为您挡住不必要的打扰。平日里，她们还可以陪您读书、散步、解闷。”" },
      { text: "你意识到，也就是说，女官长所说的贴身女官是一群和你年龄相仿的少女。\n她们会是你在王宫乃至王城凯斯中距离最近的女孩。" },
      { text: "“我现在过去。”" },
      { text: "你看向镜子。侍女为你梳起高髻，耳鬓留出几缕微卷的碎发，露出你光洁的脖颈，还有一顶小巧的珍珠发冠斜斜别在发间。\n年轻女王抬了抬下巴。这张貌美的脸上，出现了一丝显而易见的期待。" }
    ],
    choices: [
      { text: "跟随女官长离开", nextSceneId: "F119-MeetLadies" }
    ]
  }
};
