import { Scene } from "../../../../types";

export const day2Scenes05: Record<string, Scene> = {
  "F128-Lunch": {
    id: "F128-Lunch",
    title: "午餐时间",
    paragraphs: [
      { text: "结束和杜林的漫长对话，你又翻了会儿西侧厅的书。也许过了一小会儿，又也许过了一两个钟头，侍女来找你时，你已经感到有些累。" },
      { text: "在红堡的时光对你来说，总是很长。" },
      { text: "“去叫芬因来，他答应今天中午陪我吃午餐。”" },
      { text: "科尔宾领命而去，你先一步来到餐厅。\n桌子与昨日午餐时一样精致：一盘烤得金黄的小羊排，浇着迷迭香肉汁；一碟奶油焗时蔬，表面撒着碎坚果；还有一小篮刚出炉的黑面包，麦香扑鼻。银色大碗热气袅袅，你凑近一闻，发现今天是奶油蘑菇汤。" },
      { text: "不一会儿，你的金发骑士来了。" },
      { text: "“你坐在我的身边。”你指了指右手位，“对面太远了，芬，我坐在主位时，总觉得你要是坐在对面，我连你的脸都会看不清。”" },
      { text: "“这间屋子真大，凯茜，桌子也这么长！”" },
      { text: "他在你的身边落座，对一切都感到惊奇。你托着下巴看他，心里竟有一丝窃笑——当然了，你可是第一次来这，我都在这吃了两顿饭了。" },
      { text: "“所以，我一个人在这用餐多孤独啊。”你对他露出微笑，“芬，上午过得如何？”" },
      { text: "“很累。”他诚实地说，“凯茜，说真的，这可比师父的训练累多了。但也很有趣，索恩爵士说我很有剑术的天赋。”" },
      { text: "“索恩爵士看起来不会说谎。”你说，“而且你确实很有天分，大骑士不也这样说过吗？”" },
      { text: "“是啊，师父是这样说过。”芬因为你切开一块面包，“我有点想师父了，凯茜，你见过他吗？”" },
      { text: "没有。这个答案盘踞在你的心中，随即你想到罗德里克的-索恩——他向你保证过，你会再次见到芬因和大骑士。\n他重视荣誉，断然不会对你撒谎。" },
      { text: "“也许......”你含糊地说，“过几天他会回来吧。”" },
      { text: "芬因点点头。“那你上午过得好吗，凯茜？”" },
      { text: "“很好。”你想到和杜林的见面，尽管那场见面充满了责任的重量，但你并没有感到恐怖的压迫。“我还发现了一个新地方，芬，就是从这里离开再往左转的房间......”" },
      { text: "谈起那张画满了怪兽的古地图，你们都来了兴致。责任、典礼、恩典日、未来、训练，一切都被你们暂时抛之脑后。\n整个午餐时间，你都在和芬因讨论那张地图的事。" },
      { text: "渡鸦从窗外飞过。很快，午餐时间结束了。" },
      { text: "“我需要回去了，凯茜。”" },
      { text: "“今晚你也要继续在。”你认真地说，“芬，有你在，我才睡得着。”" },
      { text: "他们又拥吻了一会儿，等芬因放开你时，你的嘴唇甜蜜而发烫。" }
    ],
    choices: [
      { text: "回房间吧", nextSceneId: "F129-ScholarLesson", affect: { finn: 2 } }
    ]
  }
};
