import { Scene } from "../../../../types";

export const day2Scenes07: Record<string, Scene> = {
  "F132-Rehearsal": {
    id: "F132-Rehearsal",
    title: "首次彩排",
    paragraphs: [
      { text: "跟随侍女，你从红堡深处走向外面。\n从道路上看，你即将要去的位置离王宫大门有一些距离，但比你的卧房更近。" },
      { text: "“这里是红廷，韦斯特女士已经在等您了。”" },
      { text: "侍女将你带到一扇宏伟的橡木大门面前，你仰起头，感到自己在它面前简直像个孩子。\n侍女低头告退，你转过身，看向一直跟随你左右的科尔宾和不知道从哪冒出来的凯安：" },
      { text: "“这是哪？”" },
      { text: "“两种答案，陛下。”凯安答道，“更轻松的那一种是：这里是专门用来开大会的地方，不开大会时，这里一个人也没有。”" },
      { text: "“我以为会在议事厅。”\n这个回答让你快速地眨了眨眼，诸神啊，你又开始紧张起来了。" },
      { text: "“事实上，议事厅会是您日后更习惯的地方。”科尔宾说，“但继位典礼与其他重大庆典都在红廷，只有这间屋子才能装下所有的来宾。”" },
      { text: "“会来很多很多人吗？”" },
      { text: "“很多很多很多人。”凯安露出一点狡黠的微笑，“科尔宾爵士，让我们来陛下开门吧。”" },
      { text: "门打开了。这间屋子称得上宏伟，犹如红堡的心脏。\n艾莉丝·韦斯特走过来，对你行礼：“陛下，今天的彩排在这里进行。您从凯斯大圣堂回来后，就会进入这扇门，走过织毯时，参礼的来宾会向您行礼。当您走到王座上坐下，第一步就算完成了。”" },
      { text: "“那第二步呢？”\n你看了看道路尽头的王座，它看起来比议事厅的那张椅子更华丽，犹如一座圣龛。" },
      { text: "“第二步是致意和发布敕令。”女官长说，“今天您只需要完成第一步。”" },
      { text: "你点点头。但是，刚往前一步，等候两边的乐师就开始奏乐。\n管风琴的低鸣与银号角的长音交织在一起，旋律庄严而迟缓，像一条看不见的河流——你的脚步停了下来。你没有听过这样的音乐，它不轻松，不活泼，是一件镶满珠宝的披风，将你整个从头兜住。" },
      { text: "“请往前。”女官长耐心地引导你。" },
      { text: "一步，两步，三步。" },
      { text: "你在音乐声中走向那张无比华丽，也无比冰冷的椅子。" },
      { text: "红廷的穹顶高耸，拱肋如巨树分枝，在穹顶交汇成星形。彩色玻璃窗镶嵌着赫西家族历代国王的剪影，阳光透过它们碎成金红的光斑，洒在织毯和跪拜者的肩头。\n阳光从落地窗倾泻而下，金光将你淹没其中。你目不斜视，头颅高昂，织毯两侧的人影在余光中纷纷跪下，这一刻，你对“女王陛下”有了一些更真实的感受。" },
      { text: "你在王座前转身，这个位置能让你把整间红廷收入眼中。跪在织毯两侧的人里，有的穿着深灰的宫廷制服，有的穿着你没见过、但形制类似制服的礼服，还有一些人——\n你的目光落到离你近一些的几个脑袋上，你注意到，他们看起来也是小孩子。" },
      { text: "“您做得很好。”女官长弯腰，对你轻声说，“现在，您可以让您的臣民们起身了。”" },
      { text: "“平身。”\n你试着让自己的声音听起来更沉稳，但它仍然微微发颤。" },
      { text: "所有向你下跪的人都站了起来，你扫过那几个被你盯着的脑袋，果不其然，你看到了几张孩子的脸。\n他们是几个男孩，面容清秀，身上穿着绝非制服。" },
      { text: "你看向女官长。“斯科特大人。”艾莉丝对座下一位起身的男士喊道，“您有何新的指导？”" },
      { text: "他立即小跑上来，他的外襟别有一枚造型华丽的狐狸纹章。\n“陛下，臣是爱德华·斯科特，您的礼仪官。”他向你行了一个非常标准的礼，说话语速有些快，“您的步态很好，但行走的速度慢了一点，坐进王座时的动作也需要再纠正一点细节......”" },
      { text: "听着他的话，你意识到，这将是漫长的一次彩排。" },
      { text: "凯安和科尔宾没有像御前会议时随行你的身后，他们一直站在王座下方，看着你一遍一遍从门口走进来。\n每一次走完流程的间隙，你都看见凯安在找科尔宾说话。他们的视线一半留在你身上，一半却似乎在别的地方。" },
      { text: "真不公平，我也想讲话！", isThought: true },
      { text: "你抱着有些忿忿不平的心情，继续完成着这些流程。\n乐师们的音乐不知疲倦地响了一遍又一遍，这些音符和旋律不适合跳舞，它们正在用另一种方式沁入你的皮肤。" },
      { text: "......" },
      { text: "结束了。", isThought: true },
      { text: "重复，又重复，再重复。你几乎要不记得自己完成了几遍，终于，礼仪官点了头。\n在这之后，你向韦斯特女官长表示你需要休息——非常需要。" },
      { text: "她同意了，不如说，她看起来非常理解。\n“米德爵士，请您和法哈迪爵士送陛下回去吧。”她对你的红袍说，“她累坏了。”" }
    ],
    choices: [
      { text: "继续", nextSceneId: "F133-SamiaTeach" }
    ]
  }
};
